
import glob
import re

files=[p for p in glob.glob("**/*.json",recursive=True) if not "zh-CN" in p]
kanjis=re.compile(r"[乃卜叉之巳勺也已允云廿壬丑巴勿匁尤禾弘乎仔只疋凧汀戊卯伊夷曳亦瓜亥匡旭圭伍亙亘弛此而丞乍些亨亮什仇伶伽佃佑佼侃侠侭俄俣倖倦倭倶偲傭僑僻兇兎兜其冨凋凌凪凱剥劃劉劫匙匝匪卦厨厩厭叛叡叢叱吃吋吠吻呆咋咳哉哨哩唖啄喋喧喬嘉嘗嘘嘩噂噌噸噺嚢圃坐坤坦垢埜埠埴堰堵堺塘塙填塵壷夙奄套妓妾姐姑姥姦姪姶娃娩娼婁嬬嬰孜孟宋宍宏宕宥寅寓寵尭屍屠屡岨岱峨峯峻嵩嵯嶋嶺巌巷巽帖幌幡庄庇庖庚庵廓廟廠廻廼弗弼彊彦彪彬徽忽怜恕恢恰悉悌悶惇惟惣愈慧慾憐戎或戟托扮按挺挽捌捲捷捺掠掩掬掴掻揖摸摺撚撞撫播撰撹擢擾敦斌斐斡斯於昂昌昏晃晋晒智暢曙曝曾朋朔李杏杓杜杢杭杵杷枇柁柊柏柑柘柚柴柾栂栖栗栢栴桂桐桓桔桝桧桶梁梓梢梧梯梱梶梼棉棲椀椋椙椛椴椿楊楓楕楚楠楢楯楳榊榎榔榛槌槍槙槻樋樗樟樫樵樺樽橘橡橿檀檎櫓櫛櫨欝欣欽歎歪殆毅毘汐沌沓沫洛洩洲浩浬涌涛淀淋淘淳淵渚渠渥湊湘湛溌漉漕漣潅澗澱濠瀕瀞瀦瀧灘灸灼烏烹焔焚煉煤煽熔燈燐燕燦燭爾牌牒牝牟牡牽犀狐狗狛狸狽猪猷獅玖玲珂珊珪琉琢琳琵琶瑚瑛瑞瑳瓢甑甜甫畠畢畦畷疏疹痔癌皐盃盈瞥矧矩砥砧砺砿硯硲碇碍碓碕碗碧碩磐磯祁祇祐祢祷禄禎禦禰禽禿秤秦稀稔稗稜穆穎穐穿窄窪窺竃竣竪竺笈笠笥笹筈筏筑箆箔箕箪箭篇篠篭簸簾籾粁粂粍粕粟粥糎糞糟糠紐紗紘紬絃絢綜綬綴綾緋緬縞繋繍纂纏罫翫翰耀耶耽聡聯聾肇肋肱肴胡胤脆腔腿膏膿臥舘舛舜舵艮芙芥芦芭芹苅苑苓苔苧苫茄茅茜茸荊荏荻莞莫莱菅菖菟菩菰菱萄萌萩萱葎葡董葦葱葵葺蒋蒐蒔蒙蒜蒲蒼蓉蓑蓬蓮蔀蔓蔚蔦蔭蕃蕉蕊蕎蕗蕨蕩蕪薗薙薩薮薯藁藷蘇蘭虻蚤蛋蛎蛙蛤蛭蛸蛾蜘蝉蝋蝕蝦蝿螺蟹蟻衿袈袴袷裟裡裳襖訊訣註詑誹誼諌諏諒諜諺謂謬讃讐豹賎贋赫趨跨蹄蹟躯輔輯轍轟轡辰辻辿迂迄迦迩逗這逢逼遁遥遼邑郁鄭酉酋醇醍醐醗釆釘釦釧鈎鈷鉦鉾銚鋒鋤鋪鋲鋸錐錨錫鍍鍔鍬鍾鎗鎚鎧鏑鐙鐸鑓閃閏閤阿陀隈隼雀雁雛雫霞靖鞄鞍鞘鞠鞭韮頁頗頚頴顛飴餐饗馨馳駁駈駕駿騨髭魁魯鮎鮒鮪鮫鯉鯖鯛鯵鰍鰐鰭鰯鰹鰻鱈鱒鱗鳩鳳鳶鴇鴎鴛鴨鴫鴬鴻鵜鵠鵡鵬鷲鷹鷺鹸麟麹麿黍黛鼎鼠龍丐丕丗个丱丶丿乂乕乖乘乢亂亅亊于亞亟亠亢亰亳亶仂仄仆仍从仗仞仟仭价伉伜估佇佗佚佛佝佞佩佯佰佶佻來侈侏侑侖侘侫俎俐俑俔俘俚俛俟俤俥俯俶俾倅倆倏們倔倚倡倥倨倩倪倬偃假偈偐偕偖做偬偸傀傅傚傳傴僂僉僊僖僞僣僥僭僮僵價儁儂儉儔儕儖儘儚儡儷儺儻儼儿兀兌兒兔兢兩兪兮冀冂冉册冏冐冑冓冕冖冢冤冦冩冪冫冰冱冲决况冽凅凉凖凛凜几凩凭凰凵凾刄刋刎刔刧刪刮刳剄剋剌剏剔剞剩剪剱剳剴剽剿劈劍劑劒劔劬劭劵劼勁勍勒勗勞勠勣勦勳勵勸勹匆匈匍匏匐匕匚匣匯匱匳匸區卅卆卉卍卞卩卮卷卻厂厖厠厥厦厮厰厶參叟叨叭叮叺吁吝吩听吭吮吶吼吽呀呎呟呰呱呵呶呷呻咀咄咆咎咏咐咒咢咤咥咨咫咬咯咸咼咾哂哄哇哈哘哢哥哦哭哮哽唏唔售唳唸唹啀啅啌啖啗啜啝啣啻啼啾喀喃喇喊喘喙喞喟喨單嗄嗇嗔嗚嗟嗤嗷嗹嗽嗾嘔嘖嘛嘯嘴嘶嘸噎噐噤噪噫噬嚀嚆嚊嚏嚔嚠嚥嚮嚴嚶嚼囀囁囂囃囈囎囑囓囗囘囮囹囿圀圄圈圉國圍圓圖團圜圦圷圸圻址坎坏坡坩坿垈垉垓垠垤垪垰垳埀埃埆埒埓埔埖埣堊堋堙堝堡堯堽塋塒塢塰塲墅墫墮墸墹墺墻壅壑壓壗壘壙壜壞壟壤壥壯壹壺壻壼壽夂夊夐夘夛夥夬夭夲夸夾奎奐奕奘奚奠奢奧奩奬奸妁妍妛妝妣妲姆姙姚姜姨娉娑娚娜娟娥娵娶婀婉婢婪婬媚媼媽媾嫂嫋嫐嫖嫗嫣嫦嫩嫺嫻嬋嬌嬖嬪嬲嬶嬾孀孃孅孑孕孚孛孥孩孰孱孳孵學孺宀它宦宸寃寇寉寐寔寞寢寤寥實寨寫寰寳寶尅將專對尓尠尢尨尸尹屁屆屎屏屐屓屬屮屶屹岌岑岔岫岶岷岻岼岾峅峇峙峩峪峭峺峽崋崑崔崕崗崘崙崚崛崟崢嵋嵌嵎嵒嵜嵬嵳嵶嶂嶄嶇嶌嶐嶝嶢嶬嶮嶷嶼嶽巉巍巒巓巖巛巫巵帋帑帙帚帛帶帷幀幃幄幇幎幔幗幟幢幤幵并幺广庠廁廂廈廏廐廖廚廛廝廡廢廣廨廩廬廰廱廳廴廸廾弃弉弋弌弍弑弖弩弭弯弸彁彈彌彎彑彖彗彜彝彡彭彳彷彿徂徃徇很徊徑徘徙從徠徨徭徼忖忝忤忰忱忸忻忿怎怏怐怕怙怛怡怦怩怫怱怺恁恂恃恆恊恍恙恚恟恠恤恪恫恬恷悁悃悄悋悍悒悖悗悚悛悧悳悴悵悸悽惆惓惘惠惡惱惴惶惷惺惻愀愃愆愍愎愕愡愧愨愬愴愼愽愾愿慂慇慊慍慓慘慙慚慝慟慥慫慯慱慳慴慵慷憇憊憔憖憙憚憫憮憺懃懆懈應懊懋懌懍懣懦懴懶懷懺懼懽懾懿戀戈戉戌戍戔戛戝戞戡截戮戰戲戳扁扈扎扛扞扠扣扨扼找抂抃抉抒抓抔抖抛抬抻拂拆拇拈拊拌拏拑拔拗拜拮拯拱拵拿挂挈挌挧挾捍捏捐捩捫捶掀掉掎掏掖掟掣掫掵掾揀揄揆揉插揣揩揶搆搏搓搖搗搜搦搨搴搶摎摧摶撈撓撕撥撩撻撼擂擅擇擒擔擘據擠擡擣擧擯擱擲擴擶擺擽攀攅攘攜攝攣攤攪攬攴攵收攷攸效敍敕敖敘敝敞敲數斂斃斈斛斟斫斷旁旃旄旆旌旒旙旛无旡旱旻昃昊昜昴昵昶昿晁晄晉晏晝晞晟晢晤晧晨晰暃暄暈暉暎暘暝暸暹暼暾曁曄曉曚曠曦曩曰曵曷曼會朏朖朞朦朧朮朶朷朸朿杁杆杙杞杠杣杤杪杰杲杳杼枅枉枋枌枡枦枩枳枴枷枸枹柆柎柝柞柢柤柧柩柬柮柯栞栩栫栲桀框桍桎桙档桴桷桾桿梃梍梏梔梛條梟梠梦梭梳梵梹梺棆棊棍棔棕棗棘棠棡棣棧棯棹椁椄椈椌椏椒椚椡椢椣椥椦椨椪椰椶椹椽楔楙楜楝楞楡楪楫楮楴楸楹楾榁榑榕榜榠榧榮榱榲榴榻榾榿槁槃槇槊槎槐槓槝槞槧槨槫槭槲槹槿樂樅樊樌樒樓樔樛樞樢樣樮樶樸橄橇橈橙橢橦橲橸檄檍檐檗檜檠檢檣檪檬檮檳檸櫁櫂櫃櫑櫚櫞櫟櫪櫺櫻欅權欒欖欟欷欸欹歃歇歉歐歔歙歛歟歡歸歹歿殀殃殄殍殕殘殞殤殪殫殯殱殲殳殷殼毆毋毓毟毫毬毯毳氈氓气氛氣氤汕汞汢汨汪汳汾沁沂沍沐沒沚沛沮沱沺沽沾泄泅泓泗泙泛泝泪泯泱洌洒洙洟洫洳洵洶洸洽浙浚浣浤浹涅涎涓涕涵涸淅淆淇淌淒淕淙淞淤淦淨淪淬淮淹淺渊渕渙渝渟渣渤渫渭渮游渺渾湃湍湎湟湫湮湲湶溂溏溘溟溥溪溯溲溷溽滂滄滉滌滓滔滕滬滯滲滷滸滾滿漑漓漱漲漾漿潁潘潛潦潭潯潴潸潺潼澀澁澂澆澎澑澡澣澤澪澳澹濂濆濔濕濘濛濟濤濬濮濱濳濶濺濾瀁瀉瀋瀏瀑瀘瀚瀛瀝瀟瀰瀲瀾灌灑灣炙炬炮炯炳烋烙烝烟烱烽焉焙焜煌煕煖煢煥煦煬熄熈熏熕熙熨熬熹熾燉燎燒燔燗營燠燧燬燮燵燹燻燼燿爍爐爛爨爬爭爰爲爻爼爿牀牆牋牘牴牾犁犂犇犒犖犢犧犲犹狃狄狆狎狒狠狡狢狷狹猊猖猗猜猝猥猩猯猴猾獎獏獗獨獪獰獵獸獺獻玳玻珀珈珎珞珥珮珱珸琅琥琲琺琿瑁瑕瑙瑜瑟瑣瑤瑩瑪瑯瑰瑶瑾璋璞璢瓊瓏瓔瓠瓣瓧瓩瓮瓰瓱瓲瓷瓸甃甄甅甌甍甎甓甕甞甦甬甸甼畄畆畉畊畋畍畚畛畤畧畩畫畭畴當畸疂疆疇疉疊疔疚疝疣疥疱疳疵疸疼疽痂痃痊痍痒痙痞痣痰痲痳痺痼痾痿瘁瘉瘋瘟瘠瘡瘢瘤瘧瘰瘴瘻癆癇癈癘癜癡癢癧癨癩癪癬癰癲癶癸發皀皃皈皋皎皓皖皙皚皰皴皷皸皹皺盂盍盒盖盜盞盡盥盧盪盻眄眇眈眛眞眤眥眦眩眷眸睇睚睛睥睨睫睹睾睿瞋瞎瞞瞠瞰瞶瞹瞻瞼瞽瞿矇矍矗矚矜矣矮矼砌砒砠硅硴硼碆碌碎碚碣碪碯碵碼碾磅磆磊磋磑磔磚磧磬磴磽礇礑礒礙礦礪礫礬祀祓祕祗祚祟祠祺祿禀禊禝禧禪禮禳禹禺秉秕秡秣秧秬稈稍稘稙稟稠稱稷稻稾穃穉穗穡穢穩穰穹穽窈窕窖窗窘窩窰窶窿竄竅竇竈竊竍竏竒竓竕站竚竝竟竡竢竦竭竰竸笂笄笆笊笋笏笘笙笞笨笳笵笶筅筌筍筝筥筧筬筮筰筱筴筵筺箍箏箒箘箙箚箜箝箟箴篁篆篋篌篏篝篥篦篩篳篶篷簀簇簍簑簒簓簔簗簟簣簧簪簫簷簽籀籃籌籏籐籔籖籘籟籤籥籬籵粃粐粡粢粤粨粫粭粮粱粲粳粹粽糀糂糅糒糘糜糢糯糲糴糶糺紂紆紊紕紜紮紲紵紿絅絋絎絏絖絛絣絨絮絲絳絽綉綏經綛綟綢綣綫綮綯綰綵綸綺綽緇緕緘緜緝緞緡緤緲縅縉縊縋縒縟縡縢縣縱縲縵縷縹縺縻總繃繆繖繙繚繝繞繦繧繩繪繹繻繼繽繿纃纈纉續纎纐纒纓纔纖纛纜缸缺罅罌罍罎罐网罔罕罘罟罠罧罨罩罸罹羂羃羆羇羈羌羔羚羝羣羮羯羲羶羸羹翅翆翊翔翕翦翩翳翹耄耆耋耒耘耙耜耡耨耻耿聆聊聒聘聚聟聢聨聰聲聳聶聹聽聿肄肅肆肓肚肛肬肭胄胖胙胚胛胝胥胯胱胼脉脛脣脩脯脾腆腋腑腓腟腥腦腮腴膀膂膃膈膊膓膕膠膣膤膩膰膵膸膺膽膾臀臂臈臉臍臑臘臙臚臟臠臧臺臻臾舁舂舅與舉舊舍舐舒舖舩舫舮舳舸艀艘艙艚艝艟艢艤艨艪艫艱艷艸艾芍芒芟芫芬芻苒苙苜苞苟苡苣苳苴苹苺苻范茆茉茖茗茘茣茫茯茱茲茴茵茹荀荅荐荳荵荼莅莇莉莊莎莓莖莚莟莠莢莨莪莵莽菁菎菘菠菫菲菴菷菻菽萃萇萋萍萓萠萢萪萬萵萸萼葆葢葩葫葭葮葯葷葹蒂蒄蒟蒡蒭蒹蒻蒿蓁蓆蓊蓍蓐蓖蓙蓚蓴蓼蓿蔆蔔蔕蔗蔘蔟蔡蔬蕀蕁蕈蕋蕕蕘蕚蕣蕭蕷蕾薀薇薈薊薐薑薔薛薜薤薨薹薺藉藏藐藕藜藝藥藪藹藺藾蘂蘆蘊蘋蘓蘖蘗蘚蘢蘯蘰蘿虍虔處號虧虱蚋蚌蚓蚣蚩蚪蚫蚯蚰蚶蛄蛆蛉蛔蛛蛞蛟蛩蛬蛯蛹蛻蜀蜃蜆蜈蜉蜊蜍蜑蜒蜚蜥蜩蜴蜷蜻蜿蝌蝎蝓蝗蝙蝟蝠蝣蝨蝪蝮蝴蝸螂螟螢螫螯螳螻螽蟀蟄蟆蟇蟋蟐蟒蟠蟯蟲蟶蟷蟾蠅蠍蠎蠏蠑蠕蠖蠡蠢蠣蠧蠱蠶蠹蠻衂衄衍衒衙衞衢衫衲衵衽衾袁袂袍袒袗袙袞袢袤袮袰袱袵袿裃裄裔裘裙裝裨裲裴裹裼褂褄褊褌褓褝褞褥褪褫褶褸褻襁襃襄襌襍襞襠襤襦襪襭襯襴襷襾覃覈覊覓覘覡覦覩覬覯覲覺覽覿觀觚觜觝觧觴觸訌訐訖訛訝訥訶詁詆詈詒詛詢詬詭詼誂誄誅誑誚誡誣誥誦誨諂諄諍諚諛諞諠諡諢諤諫諱諳諷謇謌謐謔謖謗謚謠謦謨謫謳謾譁證譌譎譏譖譚譛譟譫譬譯譱譴譽讀變讌讎讒讓讖讙讚谺谿豁豈豌豎豐豕豢豫豬豸豺豼貂貅貉貊貍貎貔貘貭貮貲貳貶貽賁賈賍賚賣賤賺賻賽贄贅贇贊贍贏贐贓贔贖赧赭赱赳趁趙趺趾跂跋跌跏跖跚跛跟跣跪跫跼跿踈踉踐踝踞踟踰踴踵蹂蹇蹈蹉蹊蹌蹐蹕蹙蹠蹣蹤蹲蹶蹼躁躄躅躇躊躋躑躓躔躙躡躪躬躰躱躾軅軆軈軋軛軣軫軻軼軾輅輊輌輒輓輕輙輛輜輟輦輳輹輻輾轂轅轆轉轌轎轗轜轢轣轤辜辟辧辨辭辮辯辷迚迢迥迪迯迴迸迹迺逅逋逍逎逑逕逖逞逡逧逵逶逹逾遉遏遐遑遒遖遘遙遞遨遯遲遶遽邀邁邂邃邇邉邊邏邨邯邱邵郛郢郤鄂鄒鄙鄰鄲酊酖酘酣酥酩酲酳醂醉醋醢醪醫醯醴醵醺釀釁釉釋釐釖釛釟釡釵釶釼釿鈑鈔鈕鈞鈩鈬鈿鉅鉈鉉鉋鉐鉗鉚鉞鉤銓銕銖銛銜銷銹鋏鋩鋺錏錙錚錢錣錵錺錻鍄鍖鍜鍠鍮鍼鎔鎬鎭鎰鎹鏃鏈鏐鏖鏗鏘鏝鏤鏥鏨鐃鐇鐐鐓鐔鐚鐡鐫鐵鐶鐺鑁鑄鑒鑚鑛鑞鑠鑢鑪鑰鑵鑷鑼鑽鑾鑿钁閂閇閊閔閖閘閙閠閧閨閭閹閻閼閾闃闊闌闍闔闕闖關闡闢闥阡阨阮阯陂陋陌陏陜陝陞陟陦陬陲陷隋隍隕隗隘隧隨險隰隱隲隴隶隸隹雉雋雍雎雕雖雙雜雹霄霆霈霍霎霏霑霓霖霙霤霪霰霸霹霽霾靂靄靆靈靉靜靠靡靤靦靨靫靱靹靺靼鞁鞅鞆鞋鞏鞐鞜鞣鞦鞨鞫鞳鞴韃韆韈韋韜韭韲韵韶頌頏頡頤頷頸頽顆顋顏顫顯顰顱顳顴颪颯颱颶飃飄飆飜飩飫飭飮餃餉餒餔餘餝餞餠餡餤餬餮餽餾饂饅饉饋饌饐饑饒饕馗馘馥馭馮馼駑駘駛駝駟駢駭駮駱駲駸駻騁騅騏騫騷騾驀驂驃驅驍驕驗驛驟驢驤驥驩驪驫骭骰骼髀髏髑髓體髞髟髢髣髦髫髮髯髱髴髷髻鬆鬘鬚鬟鬢鬣鬥鬧鬨鬩鬪鬮鬯鬲鬻魃魄魍魎魏魑魘魴鮃鮑鮓鮖鮗鮟鮠鮨鮴鮹鯀鯆鯊鯏鯑鯒鯔鯡鯢鯣鯤鯰鯱鯲鰄鰆鰈鰉鰊鰌鰒鰓鰔鰕鰛鰡鰤鰥鰮鰰鰲鰺鰾鱆鱇鱚鱠鱧鱶鱸鳧鳫鳬鳰鴃鴆鴈鴉鴒鴕鴟鴣鴦鴪鴾鴿鵁鵄鵆鵈鵐鵑鵙鵝鵞鵤鵯鵲鵺鶇鶉鶚鶤鶩鶫鶯鶲鶸鶺鶻鷁鷂鷄鷆鷏鷓鷙鷦鷭鷯鷸鷽鸚鸛鸞鹵鹹鹽麁麈麋麌麑麒麕麝麥麩麪麭麸麼麾黌黎黏黐黔默黜黝點黠黥黨黯黴黶黷黹黻黼黽鼇鼈鼕鼡鼬鼾齊齋齎齏齒齔齟齠齡齣齦齧齪齬齲齶齷龕龜龝龠㐂㒵㓛㞍㟢㬢㮶㯃㰏㸿㽲䉤䑓䑛䖝䗪䡄䦰䰗丨丯丰亍仡份仿伃伋佈佉佖佟你佪佬佾侊侔侗俉俠俱倁倂倎倘倧倮倻偀偁傔僌僐僦僲儃儆儋儞儵兊兕兗冝凃凊凞凢凮刁刓刕剉剗剡劓勈勌勐勖勛勰勻匀匇匜卡卣卽厓厝厲吒吞吧呍呫呴呿咈咖咜咡咩哆哿唎唫唵啐啞喁喆喎喭嗎嘈嘎嘻噉噓噦噯噱噲噶嚙嚞嚩嚬嚳囉囊圊圡圯圳圴坰坷坼垜垸埇埈埏埤埭埵埶埿堉塤塼墉增墩壎壒壔壚壠壩夌奝奭妋妒妤姃姒姝姸娓娣婧婭婷婾媄媞媧嫄嬙嬥孁孖孽宓寘寬尒尞尣尫屛屢屺岏岟岣岪岺峋峐峒峴崍崧嵆嵇嵊嵓嵭嶁嶠嶤嶧嶸巋巢帔帘幘幞幷庾廋廹开异弇弝弣弴弶弽彀彅彔彘彤彧彽徉徜徧徯徵德忉忞忡忩怍怔怘怳怵恇悝悞惋惔惕惝惸愜愫愰愷憍憹憼戢戾扃扖扚扯抅拄拖拼挊挘挹捃捥捼揥揭揵搐搔搢摑摠摭摹撾撿擄擊擎擐擷擻攢攩敧斝昀昉昕昞昢昤昫昰昱昳昺晈晌晙晚晡晥晳晷晸暍暠暲暻曆曈曛曨曺曻朓朳杇杈杦杻极枓枘枛枻柀柗柹柼栁栝栬栱桒桛桲桵梣梥梲棈棐棨棭棰棱棼椊椵楂楉楗楣楤楨榀榥榭槏槢槩槪槵槶樏樕樻樾橅橐橖橛橫橳檉檔檝檞檥櫤櫧欛欞欬欵歆歖歠步歧歷殂殩殭每毖毗毿氅氐氳汙汜汴汶沅沆沘沜沪泆泔泠泫泮泻洄洎洮洱洹洿浘浥涂涇涉涔涪涬涿淄淖淚淛淝淼渴湄湜湞溫溱滁滇滎漐漚漪漯漳潑潙潞潡潢潾澈澌澍澔澠澧澶澼濇濊濰濵濹瀅瀆瀨灊灎灝灞灤灵炅炤炫炷烔烘烤焏焞焠焫焮焰煆煇煑煒煜煠煨熅熇熒熺燁燄燾爀爕牕牖犍犛犾狀狻猧猨獐獦獼玕玟玠玢玦玫珉珏珖珙珣珩琇琊琚琛琦琨琪琫琬琮琯琰瑄瑆瑇瑋瑗瑢瑫瑭璆璇璉璐璘璜璟璣璦璨璩璵璿瓈瓉瓚瓿甁甗甯畯畹疒痎痤瘀瘂瘈瘕瘖瘙瘞瘦瘭瘵癃癋癤癥癭癯癱皁皛皝皞皦皪皶盅盌盎盔盦盱盼眊眙眴眶睆睍睎睜睟睢睺瞀瞔瞪矠砭硃硎硏硑硨确碭碰磤磲磷礀礜礮礱礴祅祆祜祹禘禱禸秈秊秔秞秫秭稃稹穝穭窅窠窳窻竎竫竽笒笭笻筇筎筠筭筯筲箞篗篙簁簞簠簱簳簶籙籭籹粏粔粠粼糕糙糝紇紈紓紝紣紱絁絈絓絜絺綃綋綠綦緂緌緖緣縈縑縕縨繇繒繡繫纊纍罇羑羗羿翎翛翟翬翮翺耔耦耵耷耼胊胗胠胳脘腊腠腧腨腭膻臊臏臗艠艴芎芡芣芤芩芮芷芾芿苆苕苽苾茀茁茢茭茺荃荇荑荕荢荽莆莒莘莧莩莿菀菇菏菑菡菪萁萆萊葈葟葰葳蒅蒞蒯蒴蒺蓀蓂蔞蔣蔯蔲蕙蕤蕺薌薏薢薭薰藋藎藭藿蘄蘅蘐蘒蘘蘩蘸虁虗虛虢虬虵蚘蚸蛺蛼蛽蜋蝱螇螈螬螭螵蟖蟬蠆蠊蠐蠔蠟袘袪裊裎裵褘褙褚褜褧褰褲褹襀覔觔觥觶訒訕訢訷詇詎詝詡詵詹誧諐諟諴諶譆譔譙譩讝豉豨賡賴賸賾贒贛趯跎跑跗踠踣踽蹰蹻軀軺輞輭輶轔辦辵迤迨迮逈逭邈邕邗邙邛邢邳邾郄郅郇郗郝郞郯郴鄔鄕鄖鄢鄣鄧鄯鄱鄴鄽酈酛醃醞醬醱醼釗釤釥釭釱釻鈇鈐鈸鈹鈺鈼鉀鉃鉏鉸銈鋂鋋鋌鋓鋠鋿錄錟錡錥鍈鍉鍊鍤鍥鍪鍰鎛鎣鎺鏆鏞鏟鏽鐄鐳鑊鑣鑫鑱鑲閎閟閦閩閬閶閽闋闐闓闚闞陘隄隝隤隥雒雞雩雯霳霻靍靎靏靚靮靳鞕鞮鞺韁韉韛韞韴頊頞頫顒顓顖顗顙顚顥顬颺飈飧饘馞騂騃騤騭騮騸驊驎驒骶髁髃髎髖髹鬂鬈鬠鬭魞魦魲魵魹鮄鮊鮏鮞鮧鯁鯎鯥鯸鯽鰀鰣鱁鱏鱐鱓鱣鱥鱷鴝鴞鵃鵇鵒鵣鵰鵼鶊鶖鶬鶼鷀鷗鷧鸇鸕鹼麞麤麬麯麴麵黃黑鼐鼹齗龐龔龗龢欄廊朗虜殺類隆﨏塚﨑﨔凞猪神祥福﨟諸都侮僧免勉勤卑喝嘆器塀墨層屮悔慨憎懲敏既暑梅海渚漢煮琢碑社祉祈祐祖祝禍禎穀突節練繁署者臭著褐視謁謹賓贈逸難響頻𠀋𠮟𡈽𡌛𡑮𡚴𡢽𡸴𣇄𣗄𣜿𣝣𣳾𤟱𥒎𥔎𥝱𥧄𥶡𦫿𦹀𧃴𧚄𨉷𨏍𪆐㐆㐬㐮㑨㑪㒒㒼㓁㓇㔟㕝㕞㕣㕮㖦㖨㗅㗚㗴㘅㙊㚑㚖㚙㛏㝡㝢㝫㝬㝵㟁㟨㟴㟽㠀㠯㠶㡀㡜㡡㣺㤗㤚㥯㩮㩳㫖㫗㫪㬎㬚㬜㭭㭷㮇㮈㮍㮤㯍㯰㰦㳃㳒㴑㴞㵤㶚㷀㷔㸅㹠㹦㹨㺃㺔㽗㽵㽷㾮㿉㿗䀹䁘䂓䄅䅈䅏䅣䆴䆿䇦䇮䇳䈇䈎䋆䋖䋝䌂䌫䍃䏮䏰䐈䐗䐜䐢䑶䑺䒑䒳䒾䓔䔈䔍䔥䕃䖸䗥䘏䙁䙥䚡䚯䜌䝤䟽䠖䡎䢵䧧䧺䨄䨩䪼䬻䯂䯊䯒䯨䰠䳄䳑䴇䵷丂丏丒丩丫丬丮乀乇么乑乚乩亝亹亻亼仃仈仐仚仫仱仵伀伖伷伾佔佘佤佷佸佺佽侂侅侒侚侲侾俅俋俏俒俦俲倀倐倓倜倞倢偂偆偎偓偗偣偦偪偰傈傒傓傕傖傜傣傪傱傺傻僄僇僎僔僙僡僩僳儈儗儛兠关养冃冋冘冣冭冼凳凴刂划刖剕剜剬剷劂劄劘劤劦劯劺劻勊勑勷匊匋匤匵匾卂卧卬卺厤厴厷叀叕叚叴叵吤吨呃呕呢呦呬咊咍咕咠咦咭咮咷咺咿哃哬哯哱哳唀唁唉唼啁啇啊啠啡啤啽喂喈喑喿嗉嗌嗑嗒嗝嗢嗩嘇嘐嘨嘰嘷嘽嘿噀噇噞噠噭嚈嚌嚕嚚嚝嚨嚭嚲囅囍囟囨囶囷圕圣圩坅坆坌坍坨坯坳坴坵坻垚垝垞垨垬埌埗埞埦埰埸埻埽堄堞堠堧堲堹塉塌塧墊墋墍墏墐墔墝墪墱壃壍壢壳壴夅夆夋复夔夤夽奆奛奟奵奶奼妟妮妼姈姍姞姣姤姧姮娌娍娗娧娭婕婥婺媋媜媟媠媢媱媳媵媺媿嫚嫜嫠嫥嫮嫰嫵嬀嬈嬗嬭嬴孌孒孨孯孼孿宁宄宖宬寀寎寖寱寽尃尩尰屟屣屧屨屩屰屼岈岊岠岢岦岧岭岵峉崆崐崝崠崤崦崫崱崹嵂嵡嵪嵰嶈嶒嶔嶗嶙嶰嶲嶴嶹巑巗巘巠巤巩帀帒帕帟帮帾幉幖幫幬幭幮庥庪庬庹庿廆廒廙廽弈弎弜弞彇彣彲彾徏徢徤徸忄忇忋忒忓忔忢忮忯忳忼怗怢怤恌恿悊悕您悰悱悾惈惙惛惮惲惵愐愒愓愙愞愺慁慆慠慼憒憓憗憘憥憨憭懕懝懟懵戕戣戩扆扌扑扒扡扤扭扳扻抙抦拕拽挃挍挐挲挵挻挼捁捄捎捙捬掄掔掙掽揔揕揜揠揫揬揲揷搉搞搥搩搯摚摛摝摳摽撇撑撝撟擋擌擕擗擤擥擿攄攏攔攖攞攲敄敔敫敺斁斄斅斊斲斵斸斿旂旉旔旲旹旼昄昈昡昪晅晎晑晗晛晣晪晫晬晭晻暀暐暒暙暭暱暵暿曬朁朅朒朙杌杍杔杝杴杶枒枰枲柃柈柒柙柛柰柷栐栘栟栭栳栻栾桄桅桉桌桕桗桫桮桺桼梂梐梖梘梙梚梜梪梫梴梻棃棅棌棏棖棙棤棥棬棷棻椃椇椻楆楩楬楲楺楿榒榖榘榦榰榷榺榼槀槑槖槣槮槯槳槴槾樑樚樝樰樲樳樴樿橆橉橎橒橤橺橾檃檋檑檟檡檫檽櫆櫐櫔櫜櫝櫬櫱櫲櫳櫽欋欏欐欑欗欯歊歘歬歵歺殁殛殮殽殾毇毈毉毚毦毧毮毱氂氊氎氵氶氺氿汍汛汧汭沄沉沔沕沗沭泂泐泖泚泜泩泬泭洀洊洤洦洧洯洴洼浛浞浠浰涀涁涊涍涑涘涫涮涴淂淈淎淏淐淟淩淶渗渞渢渧渲渶渼湈湉湋湌湏湑湓湔湗湣溓溧溴溿滃滊滙滫滹滻漊漌漘漥漵漶漼潒潗潚潠潨潽澐澖澘澟澥澯澵澾濈濉濚濞濩濼瀀瀇瀊瀣瀹瀺瀼灃灇灋灔灥灩灬灮灶灾炁炆炕炗炟炱炻烊烑烓烜烬焃焄焆焇焈焌焯焱煊煐煓煞熀熖熛熠熢熮熯熳燋燓燙燜爇爫爴爸爹牂牓牗牣牮牯牸牿犎犭犮犰犱狁狌狳狺猇猒猘猙猬猱猳猹猽獒獫獬獮獯獱獷玁玅玊玔玘玜玞玥玨玵玷玹玼玿珅珋珡珧珹珺琁琓琤琱琹瑀瑃瑍瑒瑓瑝瑱璁璅璈璒璗璙璠璡璥璪璫璹璺璻瓖瓘瓞瓫瓯瓺甠甤甪甽甾畀畈畎畐畒畬畱畲畺畽畾疁疌疢疰疷疿痀痆痏痓痝痟痠痧痬痮痱痹瘃瘇瘏瘓瘘瘛瘜瘥瘨瘳瘼癁癉癕癮皕皜皠皡皧皨皯盉盨盬眗眚眭眵睘睠睪睲睼睽瞚瞟瞢瞤瞩矞矟矤矦矪矬矰矴矻砅砆砉砍砙砡砬硇硤硪碊碔碝碞碟碤碻磈磌磎磕磠磡磦磹磺磻磾礐礛礥礰礻祊祘祛祧祲禔禕禖禛禡禩禴离秂秇秌种秖稊稑稕稛稞稭稸穇穌穖穙穜穟穠穧穪穵穸窂窊窐窣窬窹窼窾竌竑竧竨竴笇笧笪笮笯笱笽筁筕筤筦筩筳筹筿箐箑箛箯箵箼篅篊篔篖篚篪篰簃簋簎簏簦籅籊籑籗籞籡籩籮籯籰粦粶粷粿糄糈糍糗糦糫糵紃紉紒紞紽紾絀絇絙絚絪絰絿綆綈綌綗綝綧綪綶綷緀緗緙緦緱緹縐縗縝縠縧縬繅繳繵繾纆纇纑纘纚缻缼缾罃罄罏罒罡罣罤罭罽罾羐羖羜羭翃翏翣翥翯翲耂耈耊耎耑耖耤耬耰聃聦聱聵聻肙肜肤肧肸胅胕胘胦胵胻脍脖脞脤脧脬脵脽腩膁膄膅膘膲臁臃臖臛臤臬臽臿舄舙舡舢舲舴舼艅艆艉艋艏艗艜艣艹艽艿芃芊芓芧芨芲芴芺芼苢苨苷茇茈茌茛茝茰茼荄荔荗荣荿莍莔莕莛莝菉菐菔菝菥菹萏萑萕萗萹葊葏葑葒葙葚葜葥葶葸葼蒁蒗蒦蒾蓎蓏蓓蓜蓧蓪蓯蓰蓱蓺蓽蔌蔛蔤蔥蔫蔴蔾蕏蕑蕓蕞蕡蕢蕯蕻蕽蕿薁薆薓薝薟薷薼藇藊藘藙藟藡藦藶蘀蘑蘞蘡蘤蘧蘹蘼虀虓虖虯虷虺蚇蚉蚍蚑蚜蚝蚨蚱蚳蛁蛃蛑蛕蛗蛣蛦蜅蜇蜎蜐蜓蜙蜟蜡蜣蜱蜺蜾蝀蝃蝑蝘蝤蝥蝲蝼螉螋螓螠螧螾蟁蟎蟟蟣蟥蟦蟪蟫蟭蟵蠁蠃蠋蠓蠨蠮蠲蠼衊衘衟衤衩衯袠袼袽袾裀裑裒裓裛裰裱褁褷襂襅襉襢覀覉覐覟覰覷觖觘觫觱觳觽觿訑訔訡訵訾詅詍詘誐誮誷誾諗諼謅謊謍謜謟謭譃譑譞譶譿讁讋讔讕讜讞谹谽豅豇豏豔豗豩豭豳貒貓貙貛貤賕賖賙賰賱贉贎赬趄趕趦跆跈跙跬跽踆踌踔踖踡踢踧踶踹蹋蹔蹢蹬蹭蹯躘躞躮躳躵躶躻軑軔軹輀輈輗輫轀轊轘辤辴辶迁迆迊迍迓迕迠迱迵迻适逌逷遃遄遝邅邌邐邡邰邶郃郈郜郟郫郲郶郾郿鄀鄄鄆鄘鄜鄞鄷鄹鄺酆酇酗酙酡酤酴酹醅醎醨醮醳醶釃釄釚釬釮鈁鈊鈖鈗鈳鉂鉇鉊鉎鉑鉖鉙鉠鉡鉥鉧鉨鉼鉽鉿銉銍銗銙銟銧銫銲銿鋀鋆鋎鋐鋗鋙鋥鋧鋷鋹鋻錂錍錑錕錝錞錧錩鍇鍑鍗鍚鍫鍱鍳鎈鎋鎏鎞鎡鏁鏇鏜鏢鏧鏱鏵鏻鐉鐏鐖鐗鐲鐴鐻鑅鑭鑯镸镹閆閌閍閫閴闈阝阬阳阴阼陁陡隂隚隩隯隳隺隽雘雚雝霔霣霶靁靇靕靗靛靪鞖鞚鞞鞢鞱鞲鞾韌韑韔韘韙韡韱頄頍頎頔頖頣頥頲頳顇顦颫颭颰颷颸颻颼颿飂飇飋飠飡飣飥飪飰飱飳餈餖餗餚餛餜餱餲餳餺餻餼饀饁饆饍饎饜饟饠馣馦馹馽馿駃駉駔駙駞駰駹駼騊騑騖騚騠騱騶驄驌驘骯骷骹髆髐髒髕髜髠髥髩鬃鬌鬐鬒鬖鬜鬫鬳鬽魋魣魥魫魬魳魶魷鮦鮬鮱鮲鮸鮾鯇鯘鯝鯧鯪鯫鯮鯯鯳鯷鯺鰖鰘鰙鰚鰝鰢鰧鰩鰪鰱鰶鰷鱅鱉鱊鱔鱘鱛鱜鱝鱟鱩鱪鱫鱭鱮鱰鱲鱵鱺鳦鳲鴂鴋鴑鴗鴘鴲鵂鵊鵟鵢鵩鵫鵳鵶鵷鵾鶄鶍鶙鶡鶵鶹鶽鶿鷃鷇鷉鷖鷚鷟鷠鷣鷴鸂鸊鸍鸙鸜鸝鹻麀麅麛麨麽黟黧黮黿鼂鼃鼗鼙鼯鼷鼺鼽齁齅齆齓齕齘齝齩齭齰齵﨓蘒﨡﨤爫縉艹艹辶𠂉𠂢𠂤𠆢𠈓𠌫𠍱𠎁𠏹𠑊𠔉𠗖𠘨𠝏𠠇𠠺𠢹𠥼𠦝𠫓𠬝𠵅𠷡𠹤𠹭𠺕𠽟𡈁𡉕𡉴𡉻𡋗𡋤𡋽𡌶𡍄𡏄𡑭𡗗𡙇𡜆𡝂𡧃𡱖𡴭𡵅𡵢𡵸𡶒𡶜𡶡𡶷𡷠𡸳𡼞𡽶𡿺𢅻𢈘𢌞𢎭𢛳𢡛𢢫𢦏𢪸𢭆𢭏𢭐𢮦𢰝𢰤𢷡𣆶𣇃𣇵𣍲𣏐𣏒𣏓𣏕𣏚𣏟𣏤𣑊𣑋𣑑𣑥𣓤𣕚𣖔𣘸𣘹𣘺𣙇𣜌𣜜𣝤𣟧𣟿𣠤𣠽𣪘𣱿𣴀𣴎𣵀𣷓𣷹𣷺𣽾𤂖𤄃𤇆𤇾𤎼𤘩𤚥𤢖𤩍𤭖𤭯𤰖𤴔𤸎𤸷𤹪𤺋𥁊𥁕𥄢𥆩𥇍𥇥𥈞𥉌𥐮𥓙𥖧𥞩𥞴𥧔𥫣𥫤𥫱𥮲𥱋𥱤𥸮𥹖𥹢𥹥𥻂𥻘𥻨𥼣𥽜𥿔𥿠𥿻𦀌𦀗𦁠𦃭𦉰𦊆𦍌𦐂𦙾𦚰𦜝𦣝𦣪𦥑𦥯𦧝𦨞𦩘𦪌𦪷𦰩𦱳𦳝𦹥𦾔𦿶𦿷𦿸𧄍𧄹𧏚𧏛𧏾𧐐𧑉𧘔𧘕𧘱𧚓𧜎𧜣𧝒𧦅𧪄𧮳𧮾𧯇𧲸𧶠𧸐𧾷𨂊𨂻𨊂𨋳𨐌𨑕𨕫𨗈𨗉𨛗𨛺𨥆𨥉𨥫𨦇𨦈𨦺𨦻𨨞𨨩𨩃𨩱𨪙𨫍𨫝𨫤𨯁𨯯𨴐𨵱𨷻𨸟𨸶𨺉𨻫𨼲𨿸𩊠𩊱𩒐𩗏𩙿𩛰𩜙𩝐𩣆𩩲𩷛𩸕𩸽𩹉𩺊𩻄𩻛𩻩𩿎𪀚𪀯𪂂𪃹𪎌𪐷𪗱𪘂𪘚𪚲脹銑錘]")
l2=[]
file_list=[]


def filter_json(file):
    with open(file,"r",encoding="utf-8") as f:
        contents=f.read()
        try:
            if re.search(kanjis,contents):
                file_list.append(file)
            print(file,"- チェック完了")
        except:
            print(file,"- エラー")


def get_info(file):
    with open(file,"r",encoding="utf-8") as f:
        s=f.readlines()
        for count,line in enumerate(s):
            if re.search(kanjis,line):
                for m in re.finditer(kanjis,line):
                    l=[]
                    idx=m.start()+1
                    kanji=m.group()
                    l.append(count+1)#～行
                    l.append(idx)#～文字目
                    l.append(kanji)#使用不可漢字
                    l.append(file)#ファイルのパス
                    l2.append(l)


def print_info():
    print("\n【結果】")
    if l2:
        count=1
        print("{}件見つかりました。\n".format(len(l2)))
        print("---------------------------------------\n")
        for a in l2:
            print("({})".format(count))
            print(a[3])
            print("{}：{}行 {}文字目\n".format(a[2],a[0],a[1]))
            count+=1
        print("---------------------------------------\n")
        print("使用不可漢字は以上です。")
    else:
        print("使用不可漢字は見つかりませんでした。")

def main():
    for file in files:
        filter_json(file)

    for file in file_list:
        get_info(file)

    print_info()

    input("\nEnterキーを押すと終了します。")


if __name__=="__main__":
    main()










